# Pandas
-Pandas is specially designed to work on data frames that have relational or labeled data.
-its aim align with doing a real-world data analaysis using python.

# Features
- fast and effiecient DataFrame Object with default and customized indexing.
- To load data into memory data objects from different file formats. eg: csv, excel, sql,etc.
- data alignment and itegrated handling missing data.
- reshaping and pivoting data sets.
- labeled-based slicing, indexing, and subset of large data sets.
- group by data for aggregration and transformation.

# Data Structures
- Series
- DataFrames

# Series
- it is one-dimensional array capable for holding data of any type.
- the axis labels are collectively called index.
- syntax:
    - pandas.Series(data,index,dtype, copy)

In [7]:
#importing libraries
import numpy as np
import pandas as pd

In [9]:
s=pd.Series()
s

Series([], dtype: object)

# Create a Series from ndarray
- if data is an ndarray, then index passed must be of same length.
- if no index is passed then by default index will be range(n)

In [16]:
data= np.array(['a','b','c','d','e'])
print(data)
series=pd.Series(data,index=[101,102,103,104,105])
series

['a' 'b' 'c' 'd' 'e']

101    a
102    b
103    c
104    d
105    e
dtype: object

In [20]:
#Series from list
series=pd.Series(['a','b','c','d','e'])
series

0    a
1    b
2    c
3    d
4    e
dtype: object

# Series from Dict:
- a dictionary can be passed as input and if no index is specified, then the dictionary keys are taken as sorted order to construct index.
- if index is passed, then the calues in data corresponding to the labels in the index will be pulled out.

In [33]:
import pandas as pd
data={'a':1,'c':3,'d':4,'b':2}
print (data)


series=pd.Series(data,index=['a','b','c','d'])
series

{'a': 1, 'c': 3, 'd': 4, 'b': 2}

a    1
b    2
c    3
d    4
dtype: int64

In [35]:
series=pd.Series(data)
series

a    1
c    3
d    4
b    2
dtype: int64

# Series from Scalar
- if data is scalar value, an index must be provided.
- the value will be repeated to match the length of index.
- .loc[] : for labeled data accessing.
- .iloc[] : for indexed labeled data accessing.

In [40]:
pd.Series(5,index=[1,4,5,76,8])

1     5
4     5
5     5
76    5
8     5
dtype: int64

# Accessing data from Series with Position
- data in the series can be accessed similar to that in an array

In [67]:
import pandas as pd
import numpy as np

series = pd.Series([1,2,3,4,5,6,7],index=['a','b','c','d','e','f','g'])
print(series)

series['c']

# iloc[]
print(series.iloc[2])

# .loc[]
print(series.loc['c'])

a    1
b    2
c    3
d    4
e    5
f    6
g    7
dtype: int64
3
3

In [73]:
print(series.iloc[1:5])

b    2
c    3
d    4
e    5
dtype: int64

In [75]:
print(series.loc['b':'e'])

b    2
c    3
d    4
e    5
dtype: int64

In [89]:
series.iloc[[0,4,6]]

a    1
e    5
g    7
dtype: int64

In [91]:
# Boolean Indexing
series[series%2==0]

b    2
d    4
f    6
dtype: int64

# Data Frame
- A dataFrame is two-dimensional data structure. i.e., data is align in tabular structure having rows and columns.

# Features:
- Potentially columns are of different types.
    - size - mutuable
    - labeled axis(rows and columns)
    - can perform arithematic operations on rows and columns.
- syntax :
    - `pandas.DataFrame(data, index, columns, dtype, copy)`

Creation of Data Frame
- in various inputs:
- list, dict, series, numpy arrays

In [15]:
# Empty DataFrame

import pandas as pd
df= pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [96]:
# From List
data=[1,2,3,4,5,6,7]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7

In [19]:
data = [['Alex',18],['Bob',15],['Charlie',20]]
pd.DataFrame(data,columns=['Name','Age'])

      Name  Age
0     Alex   18
1      Bob   15
2  Charlie   20

# From Dict

In [21]:
data={
    'Name':['Alex','Bob','Charlie'],
    'Age':[18,15,20]
}
pd.DataFrame(data)

      Name  Age
0     Alex   18
1      Bob   15
2  Charlie   20

# Dictionary inside List

In [118]:
data=[
    {'Name':'Alex',
    'Age':18},
    {'Name':'Bob',
     'Age':15},
    {'Name':'Charlie',
     'Age':20
        
    }
]
df=pd.DataFrame(data)
df

      Name  Age
0     Alex   18
1      Bob   15
2  Charlie   20

# Accessing

In [23]:
import numpy as np
import pandas as pd

In [43]:
data=[
    {'Name':'Alex',
    'Age':18},
    {'Name':'Bob',
     'Age':15},
    {'Name':'Charlie',
     'Age':20
        
    }
]
df=pd.DataFrame(data)
df[['Name','Age']]

df['Address']=pd.Series(['Kathmandu','Bhaktapur','Lalitpur'])
df

      Name  Age    Address
0     Alex   18  Kathmandu
1      Bob   15  Bhaktapur
2  Charlie   20   Lalitpur

In [70]:
store={
    'ProductName':['Soap','Shampoo','Toothpaste','Whiskey','Rum','Noodles'],
    'Rate':[50,300,250,8900,800,20],
    'Quantity':[12,3,4,2,1,5]
}
store_df=pd.DataFrame(store)
store_df

  ProductName  Rate  Quantity
0        Soap    50        12
1     Shampoo   300         3
2  Toothpaste   250         4
3     Whiskey  8900         2
4         Rum   800         1
5     Noodles    20         5

In [49]:
store_df.shape

(5, 3)

In [51]:
store_df.columns

Index(['ProductName', 'Rate', 'Quantity'], dtype='object')

In [53]:
len(store_df)

5

In [62]:
store_df['TotalAmount']=store_df['Rate']*store_df['Quantity']
store_df

  ProductName  Rate  Quantity  TotalAmount
0        Soap    50        12          600
1     Shampoo   300         3          900
2  Toothpaste   250         4         1000
3     Whiskey  8900         2        17800
4         Rum   800         1          800
5        Soap    20         5          100

# Pandas Functions

In [66]:
store_df['Rate'].min()

20

In [72]:
store_df[store_df['Rate']==store_df['Rate'].min()]

  ProductName  Rate  Quantity
5     Noodles    20         5

In [74]:
store_df[store_df['Rate']==store_df['Rate'].max()]

  ProductName  Rate  Quantity
3     Whiskey  8900         2

In [82]:
store_df.iloc[[0,2,3],[0,1]]

  ProductName  Rate
0        Soap    50
2  Toothpaste   250
3     Whiskey  8900

In [88]:
store_df.loc[[0,2,3],['ProductName','Quantity']]

  ProductName  Quantity
0        Soap        12
2  Toothpaste         4
3     Whiskey         2

In [90]:
store_df[store_df['Quantity']>9]

  ProductName  Rate  Quantity
0        Soap    50        12

In [92]:
store_df.drop(['Quantity','Rate'],axis=1)

  ProductName
0        Soap
1     Shampoo
2  Toothpaste
3     Whiskey
4         Rum
5     Noodles

In [94]:
store_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ProductName  6 non-null      object
 1   Rate         6 non-null      int64
 2   Quantity     6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes

In [98]:
store_df.head(3)

  ProductName  Rate  Quantity
0        Soap    50        12
1     Shampoo   300         3
2  Toothpaste   250         4

In [114]:
store_df.sample(3)

  ProductName  Rate  Quantity
2  Toothpaste   250         4
1     Shampoo   300         3
0        Soap    50        12

In [120]:
store_df['Rate'].mean()

1720.0

In [122]:
store_df['Rate'].median()

275.0

In [124]:
store_df['Rate'].count()

6

In [126]:
store_df['Rate'].mode()

0      20
1      50
2     250
3     300
4     800
5    8900
Name: Rate, dtype: int64

In [128]:
store_df['Rate'].describe()

count       6.000000
mean     1720.000000
std      3528.597455
min        20.000000
25%       100.000000
50%       275.000000
75%       675.000000
max      8900.000000
Name: Rate, dtype: float64

In [130]:
import pandas as pd
ipl_data={'Team':['Riders','Riders','Devils','Devils','Kings','Kings','Kings','Kings','Riders','Royals','Royals','riders','Riders'],
         'Rank':[1,2,2,3,3,4,1,1,2,4,1,2,1],
         'Year':[2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017,2014],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,None,876]}
ipl=pd.DataFrame(ipl_data)
ipl

      Team  Rank  Year  Points
0   Riders     1  2014   876.0
1   Riders     2  2015   789.0
2   Devils     2  2014   863.0
3   Devils     3  2015   673.0
4    Kings     3  2014   741.0
5    Kings     4  2015   812.0
6    Kings     1  2016   756.0
7    Kings     1  2017   788.0
8   Riders     2  2016   694.0
9   Royals     4  2014   701.0
10  Royals     1  2015   804.0
11  riders     2  2017     NaN
12  Riders     1  2014   876.0

In [134]:
ipl.dropna()

      Team  Rank  Year  Points
0   Riders     1  2014   876.0
1   Riders     2  2015   789.0
2   Devils     2  2014   863.0
3   Devils     3  2015   673.0
4    Kings     3  2014   741.0
5    Kings     4  2015   812.0
6    Kings     1  2016   756.0
7    Kings     1  2017   788.0
8   Riders     2  2016   694.0
9   Royals     4  2014   701.0
10  Royals     1  2015   804.0
12  Riders     1  2014   876.0

In [136]:
ipl

      Team  Rank  Year  Points
0   Riders     1  2014   876.0
1   Riders     2  2015   789.0
2   Devils     2  2014   863.0
3   Devils     3  2015   673.0
4    Kings     3  2014   741.0
5    Kings     4  2015   812.0
6    Kings     1  2016   756.0
7    Kings     1  2017   788.0
8   Riders     2  2016   694.0
9   Royals     4  2014   701.0
10  Royals     1  2015   804.0
11  riders     2  2017     NaN
12  Riders     1  2014   876.0

In [140]:
ipl.dropna(inplace=True)
ipl

      Team  Rank  Year  Points
0   Riders     1  2014   876.0
1   Riders     2  2015   789.0
2   Devils     2  2014   863.0
3   Devils     3  2015   673.0
4    Kings     3  2014   741.0
5    Kings     4  2015   812.0
6    Kings     1  2016   756.0
7    Kings     1  2017   788.0
8   Riders     2  2016   694.0
9   Royals     4  2014   701.0
10  Royals     1  2015   804.0
12  Riders     1  2014   876.0

In [142]:
ipl.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
12     True
dtype: bool

In [144]:
ipl.drop_duplicates()

      Team  Rank  Year  Points
0   Riders     1  2014   876.0
1   Riders     2  2015   789.0
2   Devils     2  2014   863.0
3   Devils     3  2015   673.0
4    Kings     3  2014   741.0
5    Kings     4  2015   812.0
6    Kings     1  2016   756.0
7    Kings     1  2017   788.0
8   Riders     2  2016   694.0
9   Royals     4  2014   701.0
10  Royals     1  2015   804.0

In [146]:
ipl

      Team  Rank  Year  Points
0   Riders     1  2014   876.0
1   Riders     2  2015   789.0
2   Devils     2  2014   863.0
3   Devils     3  2015   673.0
4    Kings     3  2014   741.0
5    Kings     4  2015   812.0
6    Kings     1  2016   756.0
7    Kings     1  2017   788.0
8   Riders     2  2016   694.0
9   Royals     4  2014   701.0
10  Royals     1  2015   804.0
12  Riders     1  2014   876.0

In [150]:
ipl.drop_duplicates(inplace=True)
ipl

      Team  Rank  Year  Points
0   Riders     1  2014   876.0
1   Riders     2  2015   789.0
2   Devils     2  2014   863.0
3   Devils     3  2015   673.0
4    Kings     3  2014   741.0
5    Kings     4  2015   812.0
6    Kings     1  2016   756.0
7    Kings     1  2017   788.0
8   Riders     2  2016   694.0
9   Royals     4  2014   701.0
10  Royals     1  2015   804.0

In [152]:
ipl['Team'].unique()

array(['Riders', 'Devils', 'Kings', 'Royals'], dtype=object)

In [154]:
ipl['Team'].nunique()

4

In [156]:
ipl['Team'].value_counts()

Team
Kings     4
Riders    3
Devils    2
Royals    2
Name: count, dtype: int64

In [158]:
ipl['Year'].unique()

array([2014, 2015, 2016, 2017])

In [160]:
ipl['Year'].nunique()

4

In [162]:
ipl['Year'].value_counts()

Year
2014    4
2015    4
2016    2
2017    1
Name: count, dtype: int64

In [164]:
ipl.sort_values(by='Team',ascending =False)

      Team  Rank  Year  Points
9   Royals     4  2014   701.0
10  Royals     1  2015   804.0
0   Riders     1  2014   876.0
1   Riders     2  2015   789.0
8   Riders     2  2016   694.0
4    Kings     3  2014   741.0
5    Kings     4  2015   812.0
6    Kings     1  2016   756.0
7    Kings     1  2017   788.0
2   Devils     2  2014   863.0
3   Devils     3  2015   673.0

In [166]:
ipl.sort_values(by=['Team','Rank'],ascending=[True,False])

      Team  Rank  Year  Points
3   Devils     3  2015   673.0
2   Devils     2  2014   863.0
5    Kings     4  2015   812.0
4    Kings     3  2014   741.0
6    Kings     1  2016   756.0
7    Kings     1  2017   788.0
1   Riders     2  2015   789.0
8   Riders     2  2016   694.0
0   Riders     1  2014   876.0
9   Royals     4  2014   701.0
10  Royals     1  2015   804.0

In [170]:
ipl['Points'].sum()

8497.0

In [172]:
ipl['Points'].cumsum()

0      876.0
1     1665.0
2     2528.0
3     3201.0
4     3942.0
5     4754.0
6     5510.0
7     6298.0
8     6992.0
9     7693.0
10    8497.0
Name: Points, dtype: float64

In [174]:
ipl["Points"].cumprod()

0     8.760000e+02
1     6.911640e+05
2     5.964745e+08
3     4.014274e+11
4     2.974577e+14
5     2.415356e+17
6     1.826009e+20
7     1.438895e+23
8     9.985934e+25
9     7.000140e+28
10    5.628112e+31
Name: Points, dtype: float64

# Aggregrate Function

In [179]:
ipl.groupby('Team')[['Points']].sum()

        Points
Team
Devils  1536.0
Kings   3097.0
Riders  2359.0
Royals  1505.0

In [181]:
ipl.groupby('Team')[['Points']].mean()

            Points
Team
Devils  768.000000
Kings   774.250000
Riders  786.333333
Royals  752.500000

In [185]:
ipl.groupby(['Team','Rank'])[['Points']].mean()

             Points
Team   Rank
Devils 2      863.0
       3      673.0
Kings  1      772.0
       3      741.0
       4      812.0
Riders 1      876.0
       2      741.5
Royals 1      804.0
       4      701.0